; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v4 ?v5)
             (pred_6 ?v13 ?v10)
             (pred_1 ?v4 ?v10)
             (pred_9 ?v9 ?v4 )
	     (pred_2 ?v4)
             (pred_11 ?v8)
             (pred_12 ?v13)
             (pred_4 ?v10)
             (pred_3 ?v4)
             (pred_7 ?v13)
             (pred_10 ?v4)
             (pred_5 ))



(:action op_1
:parameters (?v2 ?v12 ?v6 ?v11)
:precondition (and (pred_11 ?v2) (pred_11 ?v12) (pred_12 ?v6) (pred_4 ?v11)
          (pred_8 ?v2 ?v12) (pred_6 ?v6 ?v11)
                   (pred_1 ?v12 ?v11) (pred_2 ?v2) 
                   (pred_3 ?v12) (pred_7 ?v6))
:effect (and  (pred_10 ?v12) (not (pred_3 ?v12))))


(:action op_4
:parameters (?v2 ?v3)
:precondition (and (pred_11 ?v2) (pred_11 ?v3)
               (pred_2 ?v2) (pred_8 ?v2 ?v3) (pred_10 ?v3))
:effect (and (pred_2 ?v3) (not (pred_2 ?v2))))

(:action op_5
:parameters (?v2 ?v6)
:precondition (and (pred_11 ?v2) (pred_12 ?v6) 
                  (pred_2 ?v2) (pred_9 ?v6 ?v2) (pred_5 ))
:effect (and (pred_7 ?v6)
   (not (pred_9 ?v6 ?v2)) (not (pred_5 ))))


(:action op_2
:parameters (?v2 ?v1 ?v7)
:precondition (and (pred_11 ?v2) (pred_12 ?v1) (pred_12 ?v7)
                  (pred_2 ?v2) (pred_7 ?v7) (pred_9 ?v1 ?v2))
:effect (and (pred_7 ?v1) (pred_9 ?v7 ?v2)
        (not (pred_7 ?v7)) (not (pred_9 ?v1 ?v2))))

(:action op_3
:parameters (?v2 ?v6)
:precondition (and (pred_11 ?v2) (pred_12 ?v6) 
                  (pred_2 ?v2) (pred_7 ?v6))
:effect (and (pred_5 ) (pred_9 ?v6 ?v2) (not (pred_7 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_17 obj_07 obj_24 obj_21 obj_11 obj_15 obj_18 obj_20 obj_16 obj_06 obj_08 obj_22 obj_02 obj_04 obj_29 obj_14 obj_25 obj_30 obj_05 obj_31 obj_28 obj_13 obj_23 obj_27
    obj_03 obj_10 obj_19
    obj_09 obj_26 obj_01
    )

    (:init
       (pred_5)

       (pred_11 obj_12)
       (pred_11 obj_17)
       (pred_11 obj_07)
       (pred_11 obj_24)
       (pred_11 obj_21)
       (pred_11 obj_11)
       (pred_11 obj_15)
       (pred_11 obj_18)
       (pred_11 obj_20)
       (pred_11 obj_16)
       (pred_11 obj_06)
       (pred_11 obj_08)
       (pred_11 obj_22)
       (pred_11 obj_02)
       (pred_11 obj_04)
       (pred_11 obj_29)
       (pred_11 obj_14)
       (pred_11 obj_25)
       (pred_11 obj_30)
       (pred_11 obj_05)
       (pred_11 obj_31)
       (pred_11 obj_28)
       (pred_11 obj_13)
       (pred_11 obj_23)
       (pred_11 obj_27)
       (pred_4 obj_03)
       (pred_4 obj_10)
       (pred_4 obj_19)
       (pred_12 obj_09)
       (pred_12 obj_26)
       (pred_12 obj_01)

       (pred_8 obj_12 obj_11)
       (pred_8 obj_12 obj_17)
       (pred_8 obj_17 obj_15)
       (pred_8 obj_17 obj_07)
       (pred_8 obj_17 obj_12)
       (pred_8 obj_07 obj_18)
       (pred_8 obj_07 obj_24)
       (pred_8 obj_07 obj_17)
       (pred_8 obj_24 obj_20)
       (pred_8 obj_24 obj_21)
       (pred_8 obj_24 obj_07)
       (pred_8 obj_21 obj_16)
       (pred_8 obj_21 obj_24)
       (pred_8 obj_11 obj_06)
       (pred_8 obj_11 obj_15)
       (pred_8 obj_11 obj_12)
       (pred_8 obj_15 obj_08)
       (pred_8 obj_15 obj_18)
       (pred_8 obj_15 obj_17)
       (pred_8 obj_15 obj_11)
       (pred_8 obj_18 obj_22)
       (pred_8 obj_18 obj_20)
       (pred_8 obj_18 obj_07)
       (pred_8 obj_18 obj_15)
       (pred_8 obj_20 obj_02)
       (pred_8 obj_20 obj_16)
       (pred_8 obj_20 obj_24)
       (pred_8 obj_20 obj_18)
       (pred_8 obj_16 obj_04)
       (pred_8 obj_16 obj_21)
       (pred_8 obj_16 obj_20)
       (pred_8 obj_06 obj_29)
       (pred_8 obj_06 obj_08)
       (pred_8 obj_06 obj_11)
       (pred_8 obj_08 obj_14)
       (pred_8 obj_08 obj_22)
       (pred_8 obj_08 obj_15)
       (pred_8 obj_08 obj_06)
       (pred_8 obj_22 obj_25)
       (pred_8 obj_22 obj_02)
       (pred_8 obj_22 obj_18)
       (pred_8 obj_22 obj_08)
       (pred_8 obj_02 obj_30)
       (pred_8 obj_02 obj_04)
       (pred_8 obj_02 obj_20)
       (pred_8 obj_02 obj_22)
       (pred_8 obj_04 obj_05)
       (pred_8 obj_04 obj_16)
       (pred_8 obj_04 obj_02)
       (pred_8 obj_29 obj_31)
       (pred_8 obj_29 obj_14)
       (pred_8 obj_29 obj_06)
       (pred_8 obj_14 obj_28)
       (pred_8 obj_14 obj_25)
       (pred_8 obj_14 obj_08)
       (pred_8 obj_14 obj_29)
       (pred_8 obj_25 obj_13)
       (pred_8 obj_25 obj_30)
       (pred_8 obj_25 obj_22)
       (pred_8 obj_25 obj_14)
       (pred_8 obj_30 obj_23)
       (pred_8 obj_30 obj_05)
       (pred_8 obj_30 obj_02)
       (pred_8 obj_30 obj_25)
       (pred_8 obj_05 obj_27)
       (pred_8 obj_05 obj_04)
       (pred_8 obj_05 obj_30)
       (pred_8 obj_31 obj_28)
       (pred_8 obj_31 obj_29)
       (pred_8 obj_28 obj_13)
       (pred_8 obj_28 obj_14)
       (pred_8 obj_28 obj_31)
       (pred_8 obj_13 obj_23)
       (pred_8 obj_13 obj_25)
       (pred_8 obj_13 obj_28)
       (pred_8 obj_23 obj_27)
       (pred_8 obj_23 obj_30)
       (pred_8 obj_23 obj_13)
       (pred_8 obj_27 obj_05)
       (pred_8 obj_27 obj_23)
       (pred_3 obj_29)
       (pred_3 obj_06)
       (pred_3 obj_02)
       (pred_1  obj_29 obj_03)
       (pred_1  obj_06 obj_10)
       (pred_1  obj_02 obj_19)
       (pred_10 obj_12)
       (pred_10 obj_17)
       (pred_10 obj_07)
       (pred_10 obj_24)
       (pred_10 obj_21)
       (pred_10 obj_11)
       (pred_10 obj_15)
       (pred_10 obj_18)
       (pred_10 obj_20)
       (pred_10 obj_16)
       (pred_10 obj_08)
       (pred_10 obj_22)
       (pred_10 obj_04)
       (pred_10 obj_14)
       (pred_10 obj_25)
       (pred_10 obj_30)
       (pred_10 obj_05)
       (pred_10 obj_31)
       (pred_10 obj_28)
       (pred_10 obj_13)
       (pred_10 obj_23)
       (pred_10 obj_27)

       (pred_6  obj_09 obj_03)
       (pred_6  obj_26 obj_10)
       (pred_6  obj_01 obj_19)
       (pred_9 obj_09 obj_22)
       (pred_9 obj_26 obj_27)
       (pred_9 obj_01 obj_23)
       (pred_2 obj_30)
    )

    (:goal (and
       (pred_9 obj_09 obj_24)
       (pred_9 obj_01 obj_22)
    ))
(:constraints
  (always (not (pred_2 obj_25)))
)
)

; plan
1. (op_4 obj_30 obj_23)
   deleted: (pred_2 obj_30)
   added: (pred_2 obj_23)
   goals met: 0 of 2
2. (op_5 obj_23 obj_01)
   deleted: (pred_9 obj_01 obj_23) (pred_5)
   added: (pred_7 obj_01)
   goals met: 0 of 2
3. (op_4 obj_23 obj_30)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_30)
   goals met: 0 of 2
4. (op_1 obj_30 obj_02 obj_01 obj_19)
   deleted: (pred_3 obj_02)
   added: (pred_10 obj_02)
   goals met: 0 of 2
5. (op_4 obj_30 obj_02)
   deleted: (pred_2 obj_30)
   added: (pred_2 obj_02)
   goals met: 0 of 2
6. (op_4 obj_02 obj_22)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_22)
   goals met: 0 of 2
7. (op_2 obj_22 obj_09 obj_01)
   deleted: (pred_7 obj_01) (pred_9 obj_09 obj_22)
   added: (pred_7 obj_09) (pred_9 obj_01 obj_22)
   goals met: 1 of 2
8. (op_4 obj_22 obj_18)
   deleted: (pred_2 obj_22)
   added: (pred_2 obj_18)
   goals met: 1 of 2
9. (op_4 obj_18 obj_07)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_07)
   goals met: 1 of 2
10. (op_4 obj_07 obj_24)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_24)
   goals met: 1 of 2
11. (op_3 obj_24 obj_09)
   deleted: (pred_7 obj_09)
   added: (pred_5) (pred_9 obj_09 obj_24)
   goals met: 2 of 2
